linwuyen/Embedded_Test_Environment/Modbus_ControlCard/CC_only_MB/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28004x" --package "F28004x_100PZ" --part "F28004x_100PZ" --context "system" --product "C2000WARE@5.01.00.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const led       = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1      = led.addInstance();
const led2      = led.addInstance();
const cputimer  = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1 = cputimer.addInstance();
const sci       = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1      = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
led1.$name                  = "myBoardLED0";
led1.gpio.writeInitialValue = true;
led1.gpio.gpioPin.$assign   = "GPIO34";

led2.$name                  = "myBoardLED1";
led2.gpio.writeInitialValue = true;
led2.gpio.gpioPin.$assign   = "GPIO31";

cputimer1.$name          = "SWTIRMER";
cputimer1.timerPrescaler = 2;
cputimer1.timerPeriod    = 33333333;
cputimer1.startTimer     = true;

sci1.parity                = "SCI_CONFIG_PAR_EVEN";
sci1.$name                 = "DEBUG_SCI";
sci1.sci.sci_rxPin.$assign = "GPIO13";
sci1.sci.sci_txPin.$assign = "GPIO14";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
sci1.sci.$suggestSolution = "SCIB";
